
#ifndef __EXPORTS_20161105202142_1451301281_H__
#define __EXPORTS_20161105202142_1451301281_H__

#include "External.h"

typedef	Int64	HLOCK;

/*****************************************************************
/*函数说明：	分配同步锁句柄
/*参数说明：	
/*				
/*返回值：		同步锁句柄
*****************************************************************/
EXTERN_C _SYMBOL_DLL_EXPORTS HLOCK _CALLTYPE MLock_Alloc( void );


/*****************************************************************
/*函数说明：	释放同步锁资源
/*参数说明：	hLock : 同步锁句柄
/*				
/*返回值：		
*****************************************************************/
EXTERN_C _SYMBOL_DLL_EXPORTS void _CALLTYPE MLock_Free( HLOCK hLock );


/*****************************************************************
/*函数说明：	同步锁锁操作
/*参数说明：	hLock : 同步锁句柄
/*				
/*返回值：		
*****************************************************************/
EXTERN_C _SYMBOL_DLL_EXPORTS void _CALLTYPE MLock_Lock( HLOCK hLock );


/*****************************************************************
/*函数说明：	同步锁解锁操作
/*参数说明：	hLock : 同步锁句柄
/*				
/*返回值：		
*****************************************************************/
EXTERN_C _SYMBOL_DLL_EXPORTS void _CALLTYPE MLock_UnLock( HLOCK hLock );


#endif//__PLC_OMRON_20151228191441_1451301281_H__
